@echo off
title [ Aion-Light Dev. ]

:MENU
color F0
CLS
ECHO.
ECHO                        ________________________________________                       
ECHO                        _$$______$$$$$$___$$$$___$$__$$__$$$$$$_                       
ECHO                        _$$________$$____$$______$$__$$____$$___
ECHO                        _$$________$$____$$_$$$__$$$$$$____$$___
ECHO                        _$$________$$____$$__$$__$$__$$____$$___
ECHO                        _$$$$$$__$$$$$$___$$$$___$$__$$____$$___
ECHO                        ________________________________________  
ECHO.
ECHO   ^*--------------------------------------------------------------------------^*
ECHO   ^|                       Компилятор исходного кода                          ^|
ECHO   ^|                          (www.aion-light.ru)                             ^|
ECHO   ^|                                                                          ^|
ECHO   ^*--------------------------------------------------------------------------^*
ECHO   ^|                                                                          ^|
ECHO   ^|    1 - Компиляция FULL                                                   ^|
ECHO   ^|    2 - Компиляция LS                        4 - Quit                     ^|
ECHO   ^|    3 - Компиляция GS                                                     ^|
ECHO   ^|                                                                          ^|
ECHO   ^*--------------------------------------------------------------------------^*
ECHO.
SET /P Ares=              Введите: 1, 2, 3, или 4, затем нажмите ENTER: 
IF %Ares%==1 GOTO FULL
IF %Ares%==2 GOTO LoginServer
IF %Ares%==3 GOTO GameServer
IF %Ares%==4 GOTO QUIT

:FULL
CLS
ECHO   ^*--------------------------------------------------------------------------^*
ECHO   ^|                            Компиляция FULL                               ^|
ECHO   ^*--------------------------------------------------------------------------^*
ECHO.

cd ..\AL-Game
call ..\Tools\Ant\bin\ant clean dist

cd ..\LoginServer
call ..\Tools\Ant\bin\ant clean dist

GOTO :QUIT

:GameServer
CLS
ECHO   ^*--------------------------------------------------------------------------^*
ECHO   ^|                             Компиляция GS                                ^|
ECHO   ^*--------------------------------------------------------------------------^*
ECHO.
cd ..\AL-Game
start /WAIT /B ..\Tools\Ant\bin\ant clean dist
GOTO :QUIT

:LoginServer
CLS
ECHO   ^*--------------------------------------------------------------------------^*
ECHO   ^|                             Компиляция LS                                ^|
ECHO   ^*--------------------------------------------------------------------------^*
ECHO.
cd ..\LoginServer
start /WAIT /B ..\Tools\Ant\bin\ant clean dist
GOTO :QUIT

:QUIT
exit